<br>
<div style="text-align: right; font-family: Optima, sans-serif"> Jules Morris</div>
<div style="text-align: right; font-family: Optima, sans-serif"> January 2023</div>

<h1 style= "border-bottom: 10px groove maroon; margin-top: 1px; margin-bottom: 2px; text-align: left;"> Human Resources Attrition</h1>

In [7]:
#imports
#ignore warnings
import warnings
warnings.filterwarnings("ignore")

#linear algebra
import pandas as pd
import numpy as np

#visualizations
import seaborn as sns
import matplotlib.pyplot as plt

import inflection

<h1 style= "border-bottom: 10px groove blue; margin-top: 1px; margin-bottom: 2px; text-align: left;"> Executive Summary</h1>

- What is causing employees to leave the organization?

<h1 style= "border-bottom: 10px groove blue; margin-top: 1px; margin-bottom: 2px; text-align: left;"> Acquire</h1>

In [6]:
df = pd.read_csv('Human_Resources.csv')
print(f"Dataframe shape: {df.shape[0]} rows and {df.shape[1]} columns.")
print("\nColumns in this dataframe:\n", df.columns)
df.head()

Dataframe shape: 1470 rows and 35 columns.

Columns in this dataframe:
 Index(['Age', 'Attrition', 'BusinessTravel', 'DailyRate', 'Department',
       'DistanceFromHome', 'Education', 'EducationField', 'EmployeeCount',
       'EmployeeNumber', 'EnvironmentSatisfaction', 'Gender', 'HourlyRate',
       'JobInvolvement', 'JobLevel', 'JobRole', 'JobSatisfaction',
       'MaritalStatus', 'MonthlyIncome', 'MonthlyRate', 'NumCompaniesWorked',
       'Over18', 'OverTime', 'PercentSalaryHike', 'PerformanceRating',
       'RelationshipSatisfaction', 'StandardHours', 'StockOptionLevel',
       'TotalWorkingYears', 'TrainingTimesLastYear', 'WorkLifeBalance',
       'YearsAtCompany', 'YearsInCurrentRole', 'YearsSinceLastPromotion',
       'YearsWithCurrManager'],
      dtype='object')

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeNumber,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,JobRole,JobSatisfaction,MaritalStatus,MonthlyIncome,MonthlyRate,NumCompaniesWorked,Over18,OverTime,PercentSalaryHike,PerformanceRating,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
0,41,Yes,Travel_Rarely,1102,Sales,1,2,Life Sciences,1,1,2,Female,94,3,2,Sales Executive,4,Single,5993,19479,8,Y,Yes,11,3,1,80,0,8,0,1,6,4,0,5
1,49,No,Travel_Frequently,279,Research & Development,8,1,Life Sciences,1,2,3,Male,61,2,2,Research Scientist,2,Married,5130,24907,1,Y,No,23,4,4,80,1,10,3,3,10,7,1,7
2,37,Yes,Travel_Rarely,1373,Research & Development,2,2,Other,1,4,4,Male,92,2,1,Laboratory Technician,3,Single,2090,2396,6,Y,Yes,15,3,2,80,0,7,3,3,0,0,0,0
3,33,No,Travel_Frequently,1392,Research & Development,3,4,Life Sciences,1,5,4,Female,56,3,1,Research Scientist,3,Married,2909,23159,1,Y,Yes,11,3,3,80,0,8,3,3,8,7,3,0
4,27,No,Travel_Rarely,591,Research & Development,2,1,Medical,1,7,1,Male,40,3,1,Laboratory Technician,2,Married,3468,16632,9,Y,No,12,3,4,80,1,6,3,3,2,2,2,2

<h1 style= "border-bottom: 10px groove blue; margin-top: 1px; margin-bottom: 2px; text-align: left;"> Prepare</h1>

In [4]:
def df_info(df):
    '''This function will take in a dataframe and return a summary of the unique and missing values,\
    the percentage of missing values per row, and the column dtype in tabular form.'''
    
    # Show all the columns 
    pd.set_option('display.max_columns', None) 
    
    # Show all rows
    pd.set_option('display.max_rows', None) 
    print("Dtype, Unique values and Missing values(%) of each column:")
    
    #create the df
    df_info= pd.DataFrame({"Dtype": df.dtypes, 
                           "Unique values": df.nunique(),
                           "Missing values (%)": round(df.isnull().sum()/df.shape[0] * 100, 2)
                          }).rename_axis('Columns', axis='rows')  
    
    #style the df for easier readability
    df_info = df_info.style.format({'Missing values (%)': '{:,.2f}'})\
         .set_table_styles([{'selector': 'td', 'props': [('text-align', 'center'),
                                                        ('color', 'black')]},
                           {'selector': '.col_heading', 'props': [('text-align', 'center'),
                                                                  ('color', 'black'),
                                                                  ('width', '150px')]},
                           {'selector': '.row_heading', 'props': [('text-align', 'left'),
                                                                  ('color', 'black')]}])
    return df_info

In [5]:
df_info(df)

Dtype, Unique values and Missing values(%) of each column:

- There are no missing values in this dataset, will change from SnakeCase to camel_case using  the Inflection library.

<h1 style= "border-bottom: 10px groove blue; margin-top: 1px; margin-bottom: 2px; text-align: left;"> Explore</h1>